// Задача 1. Проверить, является ли первое число квадратом втого числа.
/*
Console.Write("Введите первое число: ");
int a = Convert.ToInt32(Console.ReadLine());

Console.Write("Введите второе число: ");
int b = Convert.ToInt32(Console.ReadLine());

int quad = b * b;

if (a == quad)
{
    Console.WriteLine($"Число {a} является квадратом числа {b}");
}
else
{
    Console.WriteLine($"Число {a} не является квадратом числа {b}");
}
*/

//Задача 2. Одна переменная. На выходе: все int от -n до n.

/*
Console.Write("Введите число: ");
int n = Convert.ToInt32(Console.ReadLine());

int current = -n;

while (current <= n)
{
    Console.Write(current + " ");
    current++;
}
*/